Unfortunately, even using prefixes, a gateway destroy/create cycle is performed when the config is updated. This will cause downtime while the gateway is being re-created.

```
  # module.apigw-bilt-external.google_api_gateway_api_config.bilt_external must be replaced
+/- resource "google_api_gateway_api_config" "bilt_external" {
      ~ api_config_id        = "bilt-external20210513174550666500000001" -> (known after apply)
      ~ display_name         = "bilt-external20210513174550666500000001" -> (known after apply)
      ~ id                   = "projects/xxx/locations/global/apis/bilt-external/configs/bilt-external20210513174550666500000001" -> (known after apply)
      - labels               = {} -> null
      ~ name                 = "projects/xxx/locations/global/apis/bilt-external/configs/bilt-external20210513174550666500000001" -> (known after apply)
      ~ project              = "xxx" -> (known after apply)
      ~ service_config_id    = "bilt-external20210513174550666500000-00p0et6x7m1dx" -> (known after apply)
        # (2 unchanged attributes hidden)

  # module.apigw-bilt-external.google_api_gateway_gateway.bilt_external must be replaced
-/+ resource "google_api_gateway_gateway" "bilt_external" {
      ~ api_config       = "projects/xxx/locations/global/apis/bilt-external/configs/bilt-external20210513174550666500000001" -> (known after apply) # forces replacement
      ~ default_hostname = "bilt-external-xxx.uc.gateway.dev" -> (known after apply)
      ~ display_name     = "bilt-external" -> (known after apply)
      ~ id               = "projects/xxx/locations/us-central1/gateways/bilt-external" -> (known after apply)
      - labels           = {} -> null
      ~ name             = "projects/xxx/locations/us-central1/gateways/bilt-external" -> (known after apply)
      ~ project          = "xxx" -> (known after apply)
      + region           = (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }
```